# ДЗ 1 Часть 1

Уважаемые слушатели, решения задач пока что необходимо сохранять локально у
себя на компьютере. Чуть позже мы с вами познакомимся с GIT, и вы выложите свои
решения туда для проверки командой курса. Об этом мы поговорим на третьей неделе
программы!

Вопросы по ДЗ пишите в общий чат, указав номер задачи или сразу ее условие в
сообщении.

ДЗ 1 будет состоять из трех частей. Части 2 и 3 будут выложены позже.

## ДЗ 1 Часть 1

**Примечание** во всех заданиях, где необходимы<br>
Входные данные — вводятся с консоли, используя объект Scanner()<br>
Выходные данные — выводятся в консоль с помощью System.out.println()

Ограничения входных данных даны для ознакомления, валидировать входные данные
не нужно. Также не нужно приглашать к вводу (т.е. не нужно дополнительно выводить
указание, какие значения сейчас будут переданы). Пояснений к выходным данным
тоже добавлять не нужно.
